---
kind: type
id: T:Autodesk.Revit.DB.WidthMeasuredAt
source: html/71ec86d8-1032-1d91-0114-bc29d8e5d48b.htm
---
# Autodesk.Revit.DB.WidthMeasuredAt

The allowed values for the WALL_TYPE_WIDTH_MEASURED_AT parameter.

## Syntax (C#)
```csharp
public enum WidthMeasuredAt
```